[
{"ticker":"DHR","headline":"DHR rises after strong quarterly automation orders, management cites renewed demand in lab and diagnostics automation."},
{"ticker":"ABBV","headline":"AbbVie shares climb as new immunology drug posts better‑than‑expected trial data, lifting near‑term revenue outlook."},
{"ticker":"NFLX","headline":"Netflix falls amid slowing subscriber additions and higher churn in North America, prompting concerns over content spend."},
{"ticker":"XOM","headline":"ExxonMobil retreats after refining margins compress and downstream volumes miss seasonal expectations."},
{"ticker":"WFC","headline":"Wells Fargo slides as loan growth softens and credit costs tick up, weighing on quarter‑ahead guidance."},
{"ticker":"PM","headline":"Philip Morris slips after weaker cigarette volume in key European markets offsets pricing gains."},
{"ticker":"KO","headline":"Coca‑Cola steady as sparkling beverage volumes rebound and syrup pricing improves margins across international markets."},
{"ticker":"AMZN","headline":"Amazon down following softer cloud guidance; AWS growth cools as enterprise AI capex moderates."},
{"ticker":"AVGO","headline":"Broadcom pressured after semiconductor customers trim orders for networking chips amid inventory normalization."},
{"ticker":"JPM","headline":"JPMorgan underperforms after trading revenues decline and capital markets activity lags expectations."},
{"ticker":"MRK","headline":"Merck advances on positive oncology trial readouts and upbeat commentary about commercial launches."},
{"ticker":"HD","headline":"Home Depot retreats as seasonal renovation demand softens and same‑store sales miss estimates."},
{"ticker":"TSLA","headline":"Tesla dips after deliveries miss Street forecasts and competition in EV price tiers intensifies."},
{"ticker":"GOOGL","headline":"Alphabet pressured as advertising growth cools and YouTube monetization misses analyst models."},
{"ticker":"COST","headline":"Costco pulls back on margin pressure from higher logistics costs despite continued membership growth."},
{"ticker":"V","headline":"Visa weakens amid slowing cross‑border volumes and cautious consumer spending trends."},
{"ticker":"JNJ","headline":"Johnson & Johnson gains after pipeline updates and stable consumer health sales soothe investor concerns."},
{"ticker":"PG","headline":"Procter & Gamble climbs as price realization and cost savings offset input cost headwinds in the quarter."},
{"ticker":"ABT","headline":"Abbott jumps on stronger device sales and expanding adoption of diagnostics platforms in hospitals."},
{"ticker":"BRK","headline":"Berkshire Hathaway steadies as diversified holdings benefit from insurance float and industrial earnings."},
{"ticker":"AAPL","headline":"Apple retreats despite iPhone unit growth—services revenue slows and macro uncertainty dents guidance."},
{"ticker":"CVX","headline":"Chevron down after downstream margins compress and capex guidance disappoints relative to peers."},
{"ticker":"VZ","headline":"Verizon edges higher as fiber and 5G enterprise deals support service revenue momentum."},
{"ticker":"BAC","headline":"Bank of America slips on weaker mortgage origination volumes and slowing consumer lending growth."},
{"ticker":"UPS","headline":"UPS rises after holiday shipping volumes ramp and management flags better network efficiency."},
{"ticker":"DIS","headline":"Disney under pressure as theme‑park attendance lags and streaming losses remain elevated."},
{"ticker":"META","headline":"Meta shares fall amid lower ad demand and higher AI infrastructure spending weighing on margins."},
{"ticker":"MSFT","headline":"Microsoft gains on robust cloud backlog and enterprise AI deal announcements boosting Azure demand."},
{"ticker":"INTC","headline":"Intel weakens after wallet‑share losses in data center chips and continued manufacturing cost pressures."},
{"ticker":"UNH","headline":"UnitedHealth retreats as medical cost trends accelerate and margin outlook is revised downward."},
{"ticker":"MCD","headline":"McDonald’s climbs as menu price mix and strong comps in international markets lift margins."},
{"ticker":"TMO","headline":"Thermo Fisher slides after lower consumables demand and tougher comps in lab equipment sales."},
{"ticker":"CMCSA","headline":"Comcast edges up as broadband subscriber additions beat estimates and content licensing revenue improves."},
{"ticker":"PEP","headline":"PepsiCo inches higher on stronger beverage volume and early cost‑saving program benefits."},
{"ticker":"WMT","headline":"Walmart rises as same‑store sales beat expectations and inventory levels normalize ahead of holidays."},
{"ticker":"LLY","headline":"Eli Lilly gains after encouraging diabetes drug uptake and optimistic commentary on late‑stage candidates."},
{"ticker":"CRM","headline":"Salesforce falls as license growth decelerates and customers push back on large‑scale CRM rollouts."},
{"ticker":"ACN","headline":"Accenture slips after softer consulting demand in telecom and media weighs on short‑term bookings."},
{"ticker":"ADBE","headline":"Adobe retreats as creative cloud subscription growth slows and FX headwinds hit international sales."},
{"ticker":"CSCO","headline":"Cisco steadies with improving enterprise spending on networking gear and cautious service‑chain recovery."},
{"ticker":"NVDA","headline":"NVIDIA pulls back after a period of heavy multiple expansion and signs of cooling AI accelerator demand."},
{"ticker":"NKE","headline":"Nike rises on stronger than expected wholesale replenishment and solid direct‑to‑consumer growth."},
{"ticker":"AMD","headline":"AMD down as competitive pressure in data center GPUs and inventory digestion weigh on near‑term results."},
{"ticker":"MA","headline":"Mastercard softens with lower cross‑border travel volumes and muted consumer spending trends."},
{"ticker":"TXN","headline":"Texas Instruments slides after industrial end‑market weakness and conservative guidance for next quarter."}
]
